Repository: loregbrw/LogManagerAPI
Catalog: LogManagerAPI/API/Resources/Errors.*.resx
Languages: pt_br

# UnknownError
source: Unknown internal server error.
pt_br: Erro interno desconhecido.

# UnknownErrorMapping
source: Unknown error mapping entity.
pt_br: Erro desconhecido ao mapear entidade.

# EntityNotFound
source: {0} not found.
pt_br: {0} não encontrado.

# NullOrWhiteSpace
source: {0} cannot be null or white space.
pt_br: {0} não pode ser nulo ou conter apenas espaços em branco.

# FieldTooLong
source: {0} cannot longer than {1} characters.
pt_br: {0} não pode ter mais que {1} caracteres.

# FieldRequired
source: {0} is required.
pt_br: {0} é obrigatório.

# InvalidEnumValue
source: {1} isn't a valid value for {0}.
pt_br: {1} não é um valor válido para {0}.

# InvalidPassword
source: Invalid password: minimum 8 characters, 1 number, 1 letter, and 1 special character.
pt_br: Senha inválida: mínimo de 8 caracteres, 1 número, 1 letra e 1 caractere especial.

# WrongPassword
source: Incorrect password.
pt_br: Senha incorreta.

# NotAuthenticated
source: User not authenticated.
pt_br: Usuário não autenticado.

# NoRegisteredPassword
source: User hasn't registered a password yet.
pt_br: Usuário ainda não registrou uma senha.

# NoAccess
source: User doesn't have access.
pt_br: Usuário não possui acesso.

# AlreadyExists
source: {0} already exists on the database.
pt_br: {0} já existe no banco de dados.

# UserCodeAlreadyExists
source: A user with the code {0} already exists.
pt_br: Já existe um usuário com o código {0}.

# UserEmailAlreadyExists
source: A user with the email {0} already exists.
pt_br: Já existe um usuário com o e-mail {0}.

# UserAlreadyRegistered
source: User {0} is already registered.
pt_br: O usuário {0} já está registrado.

# MissingRegistrationEmail
source: It's not possible to complete the registration of a user without a registered email.
pt_br: Não é possível completar o registro de um usuário sem e-mail cadastrado.

# EmptyCsv
source: Csv is empty.
pt_br: O arquivo CSV está vazio.

# MissingFieldCsv
source: Missing field at position {0}.
pt_br: Campo ausente na posição {0}.

# BadDataCsv
source: Bad data found at row {0}.
pt_br: Dado inválido encontrado na linha {0}.

# InvalidHeaderCsv
source: Invalid csv header.
pt_br: Cabeçalho do CSV inválido.

# ErrorProcessingCsv
source: Error processing csv: {0}.
pt_br: Erro ao processar CSV: {0}.

# MissingCsv
source: Csv is missing.
pt_br: CSV não encontrado.

# MissingHeader
source: Csv header is missing.
pt_br: O CSV está sem cabeçalho.

# DuplicateHeaders
source: Duplicate headers for property {0} found in CSV.
pt_br: Foram encontrados cabeçalhos duplicados para a propriedade {0} no CSV.

# NoMatchingHeaders
source: No matching headers found in CSV.
pt_br: Nenhum cabeçalho correspondente encontrado no CSV.

# InvalidCurrencyFormat
source: Invalid currency format for {0}.
pt_br: Formato de moeda inválido para {0}.

# InvalidCurrencyType
source: Invalid type {0} for currency conversion. Expected decimal or numeric type.
pt_br: Tipo {0} inválido para conversão monetária. Esperado decimal ou tipo numérico.

# InvalidDelimiter
source: Invalid CSV delimiter. Allowed delimiters are: ; | , and tab.
pt_br: Delimitador CSV inválido. Delimitadores permitidos: ; | , e tab.

# MissingClaim
source: Token missing {0} claim.
pt_br: O token está sem o claim {0}.

# InvalidClaim
source: Invalid claim {0}.
pt_br: Claim {0} inválido.

source: Token expired.
pt_br: Token expirado.

source: Invalid token.
pt_br: Token inválido.

source: Token validation failed.
pt_br: Falha na validação do token.

# MissingAuthorizationHeader
source: Missing or invalid Authorization header.
pt_br: Header Authorization ausente ou inválido.

# ForbiddenEndpoint
source: You do not have permission to access this endpoint.
pt_br: Você não tem permissão para acessar este endpoint.

# UserMissingEmail
source: User doesn't have a registered email.
pt_br: O usuário não possui um e-mail registrado.
